import React from "react";
import { Link } from "react-router-dom";
import CategoryMenu from "./categoryMenu";

function Header({ onSelectCategory }) {
  return (
    <div className="container">
      <div className="header__body">
        <div className="header__group">
          <Link to="/" className="header__logo">
            <h1>BexaShop</h1>
          </Link>
          <CategoryMenu onSelectCategory={onSelectCategory} />
        </div>

        <nav className="header__nav">
          <ul className="header__column">
            <li className="header__item">
              <Link to="/orders" className="header__link">
                <svg
                  title="Заказы"
                  viewBox="0 0 24 24"
                  width="30"
                  height="30"
                  fill="currentColor"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M12.0002 8.79341L6.70373 6.67341H6.70473L11.9992 4.55342L17.2967 6.67341L12.0002 8.79341ZM20.3405 5.73101L12.3724 2.54177C12.1332 2.44604 11.8662 2.44604 11.627 2.54177L3.63058 5.74234C3.19743 5.9155 2.98743 6.31528 3.00058 6.70817V17.3286C3.00063 17.5289 3.06067 17.7247 3.17296 17.8906C3.28526 18.0566 3.44467 18.1851 3.63066 18.2596L11.6271 21.4602C11.7793 21.5212 11.9441 21.544 12.1072 21.5265C12.2086 21.5156 12.3074 21.4894 12.4003 21.449L20.3689 18.2596C20.5551 18.1852 20.7147 18.0567 20.8272 17.8908C20.9397 17.7248 20.9999 17.529 21 17.3285V6.67333C21 6.61264 20.9945 6.5523 20.9836 6.49301C20.9331 6.20788 20.7619 5.94217 20.4699 5.78885C20.4281 5.76652 20.3849 5.7472 20.3405 5.73101ZM5.00721 8.15548L7.36766 9.10025L10.997 10.5532V19.0472L5.00721 16.6493V8.15548ZM18.9934 8.15522L13.0036 10.5531V19.0472L18.9934 16.6493V8.15522Z"
                  ></path>
                </svg>
                <span>Заказы</span>
              </Link>
            </li>

            <li className="header__item">
              <Link to="/favourites" className="header__link">
                <svg
                  title="Избранное"
                  xmlns="http://www.w3.org/2000/svg"
                  width="30"
                  height="30"
                  viewBox="0 0 24 24"
                  fill="currentColor"
                >
                  <path d="M12 4.36693C10.675 3.27975 9.24521 2.71991 7.72945 2.71991C4.56517 2.71991 2 5.28506 2 8.44934C2 12.7785 5.19725 16.9814 11.4484 21.1143L11.9998 21.4789L12.5513 21.1143C18.8026 16.9814 22 12.7785 22 8.44934C22 5.28505 19.4349 2.71991 16.2706 2.71991C14.7548 2.71991 13.325 3.27975 12 4.36693ZM4 8.44934C4 6.38963 5.66973 4.71991 7.72945 4.71991C8.95344 4.71991 10.132 5.27022 11.296 6.42424L12 7.12225L12.7041 6.42423C13.8681 5.27022 15.0466 4.71991 16.2706 4.71991C18.3303 4.71991 20 6.38962 20 8.44934C20 11.8468 17.3766 15.4058 11.9999 19.0755C6.62334 15.4058 4 11.8468 4 8.44934Z"></path>
                </svg>
                <span>Избранное</span>
              </Link>
            </li>

            <li className="header__item">
              <Link to="/cart" className="header__link">
                <svg
                  title="Корзина"
                  xmlns="http://www.w3.org/2000/svg"
                  width="30"
                  height="30"
                  viewBox="0 0 24 24"
                  fill="currentColor"
                >
                  <path d="M6.9628 2L14.373 2C14.471 2 14.591 2 14.698 2.008C14.826 2.017 15.001 2.041 15.191 2.123C15.442 2.232 15.659 2.407 15.818 2.63C15.938 2.798 15.998 2.965 16.034 3.087C16.064 3.191 16.089 3.308 16.109 3.404L17.308 9H15.263L14.192 4H7.237L8.906 11.791C9.04 12.413 8.565 13 7.929 13C7.457 13 7.05 12.671 6.951 12.209L5.224 4.151C5.194 4.009 5.159 3.846 5.141 3.702C5.121 3.541 5.106 3.294 5.196 3.023C5.311 2.682 5.544 2.393 5.854 2.209C6.1 2.064 6.345 2.027 6.507 2.013C6.651 2 6.818 2 6.963 2Z"></path>
                  <path d="M5.455 10H1V13H2.5L3.603 19.343C3.77 20.301 4.601 21 5.574 21H18.376C19.343 21 20.171 20.309 20.344 19.358L21.5 13H23V10H9.546L9.884 11.581C9.915 11.722 9.929 11.862 9.93 12H19.649L18.376 19H5.574L4.356 12H5.883L5.455 10Z"></path>
                </svg>
                <span>Корзина</span>
              </Link>
            </li>
          </ul>
        </nav>
      </div>
    </div>
  );
}

export default Header;
